fix : Lint issues + badly placed imports
